; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v2 - type_2 ?v4 - type_1)
 	      (pred_3 ?v3 - object ?v4 - type_1)
	      (pred_2 ?v2 - type_2 ?v5 - type_3)
	      (pred_1 ?v2 - type_2 ?v3 - object ?v5 - type_3))

   (:action op_3
       :parameters  (?v2 - type_2 ?v1 ?v8 - type_1)
       :precondition (and  (pred_4 ?v2 ?v1))
       :effect (and  (pred_4 ?v2 ?v8)
		     (not (pred_4 ?v2 ?v1))))

   (:action op_2
       :parameters (?v2 - type_2 ?v6 - object ?v7 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_3 ?v6 ?v7) (pred_4 ?v2 ?v7) (pred_2 ?v2 ?v5))
       :effect (and (pred_1 ?v2 ?v6 ?v5)
		    (not (pred_3 ?v6 ?v7)) 
		    (not (pred_2 ?v2 ?v5))))

   (:action op_1
       :parameters (?v2 - type_2 ?v6 - object ?v7 - type_1 ?v5 - type_3)
       :precondition  (and  (pred_1 ?v2 ?v6 ?v5) (pred_4 ?v2 ?v7))
       :effect (and (pred_3 ?v6 ?v7)
		    (pred_2 ?v2 ?v5)
		    (not (pred_1 ?v2 ?v6 ?v5)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_02 - type_2
obj_03 obj_06 - type_3
obj_01 obj_09 obj_08 - type_1
obj_07 obj_05 obj_04 - object)
(:init
(pred_4 obj_02 obj_09)
(pred_2 obj_02 obj_03)
(pred_2 obj_02 obj_06)
(pred_3 obj_07 obj_08)
(pred_3 obj_05 obj_08)
(pred_3 obj_04 obj_09)
)
(:goal
(and
(pred_3 obj_07 obj_09)
(pred_3 obj_05 obj_01)
(pred_3 obj_04 obj_08)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_02 ?b obj_06))))
)
)

; plan
1. (op_2 obj_02 obj_04 obj_09 obj_03)
   deleted: (pred_3 obj_04 obj_09) (pred_2 obj_02 obj_03)
   added: (pred_1 obj_02 obj_04 obj_03)
   goals met: 0 of 3
2. (op_3 obj_02 obj_09 obj_08)
   deleted: (pred_4 obj_02 obj_09)
   added: (pred_4 obj_02 obj_08)
   goals met: 0 of 3
3. (op_1 obj_02 obj_04 obj_08 obj_03)
   deleted: (pred_1 obj_02 obj_04 obj_03)
   added: (pred_3 obj_04 obj_08) (pred_2 obj_02 obj_03)
   goals met: 1 of 3
4. (op_2 obj_02 obj_07 obj_08 obj_03)
   deleted: (pred_3 obj_07 obj_08) (pred_2 obj_02 obj_03)
   added: (pred_1 obj_02 obj_07 obj_03)
   goals met: 1 of 3
5. (op_3 obj_02 obj_08 obj_09)
   deleted: (pred_4 obj_02 obj_08)
   added: (pred_4 obj_02 obj_09)
   goals met: 1 of 3
6. (op_1 obj_02 obj_07 obj_09 obj_03)
   deleted: (pred_1 obj_02 obj_07 obj_03)
   added: (pred_3 obj_07 obj_09) (pred_2 obj_02 obj_03)
   goals met: 2 of 3
7. (op_3 obj_02 obj_09 obj_08)
   deleted: (pred_4 obj_02 obj_09)
   added: (pred_4 obj_02 obj_08)
   goals met: 2 of 3
8. (op_2 obj_02 obj_05 obj_08 obj_03)
   deleted: (pred_3 obj_05 obj_08) (pred_2 obj_02 obj_03)
   added: (pred_1 obj_02 obj_05 obj_03)
   goals met: 2 of 3
9. (op_3 obj_02 obj_08 obj_01)
   deleted: (pred_4 obj_02 obj_08)
   added: (pred_4 obj_02 obj_01)
   goals met: 2 of 3
10. (op_1 obj_02 obj_05 obj_01 obj_03)
   deleted: (pred_1 obj_02 obj_05 obj_03)
   added: (pred_3 obj_05 obj_01) (pred_2 obj_02 obj_03)
   goals met: 3 of 3
